app/Controllers/tftController.php

    public function profiel()
    {
        $user = auth()->user();
        $userId = $user ? $user->id : null;
        // Debug
        // echo 'User ID: ' . $userId;
        $model = model(tftModel::class);
        $user = $model->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1