app/Models/tftModel.php

    public function updateUser($userId, $newUsername, $leeftijd, $secret, $newGeboortedatum) {
        $this->db->transStart();

        $this->db->table('users')
        ->where('id', $userId)
        ->update([
            'username' => $newUsername,
            'leeftijd' => $leeftijd,
            'geboortedatum' => $newGeboortedatum,
        ]);

$this->db->table('auth_identities')
        ->where('user_id', $userId)
        ->update([
            'secret' => $secret,
        ]);
---
UPDATE `users` SET `username` = 'RohitW', `leeftijd` = '1', `geboortedatum` = '2014-04-08'
WHERE `id` = 1
UPDATE `auth_identities` SET `secret` = 'rohitgame01@gmail.com'
WHERE `user_id` = 1